<div class="row">
        <div class="col-lg-9">
<h1>175.Combine Two Tables</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Table: <code>Person</code></p>

<pre>
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| PersonId    | int     |
| FirstName   | varchar |
| LastName    | varchar |
+-------------+---------+
PersonId is the primary key column for this table.
</pre>

<p>Table: <code>Address</code></p>

<pre>
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| AddressId   | int     |
| PersonId    | int     |
| City        | varchar |
| State       | varchar |
+-------------+---------+
AddressId is the primary key column for this table.
</pre>

<p>&nbsp;</p>

<p>Write a SQL query for a report that provides the following information for each person in the Person table, regardless if there is an address for each of those people:</p>

<pre>
FirstName, LastName, City, State
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("Person", engine)

   PersonId FirstName LastName
0         1     Allen     Wang

In [3]:
pd.read_sql_table("Address", engine)

   AddressId  PersonId           City     State
0          1         2  New York City  New York

In [4]:
query = '''
SELECT p.FirstName, p.LastName, a.City, a.State
FROM Person p
LEFT JOIN Address a
ON p.PersonId = a.PersonId;
'''

pd.read_sql_query(query, engine)

  FirstName LastName  City State
0     Allen     Wang  None  None

## Note
# Time:  O(n), n is size of Person Table
# Space: O(n)